cursoArquitecturaJava/LABM1C3-06WSAuth-client/alumno.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://ws.jaad.cibertec.edu/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://ws.jaad.cibertec.edu/" name="BasicAlumnoServiceService">
<types>
<xsd:schema>
<xsd:import namespace="http://ws.jaad.cibertec.edu/" schemaLocation="http://localhost:8080/alumno?xsd=1"></xsd:import>
</xsd:schema>
</types>
<message name="registrar">
<part name="parameters" element="tns:registrar"></part>
</message>
<message name="registrarResponse">
<part name="parameters" element="tns:registrarResponse"></part>
</message>
<message name="consultar">
<part name="parameters" element="tns:consultar"></part>
</message>
<message name="consultarResponse">
<part name="parameters" element="tns:consultarResponse"></part>
</message>
<portType name="AlumnoService">
<operation name="registrar">
<input wsam:Action="http://ws.jaad.cibertec.edu/AlumnoService/registrarRequest" message="tns:registrar"></input>
<output wsam:Action="http://ws.jaad.cibertec.edu/AlumnoService/registrarResponse" message="tns:registrarResponse"></output>
</operation>
<operation name="consultar">
<input wsam:Action="http://ws.jaad.cibertec.edu/AlumnoService/consultarRequest" message="tns:consultar"></input>
<output wsam:Action="http://ws.jaad.cibertec.edu/AlumnoService/consultarResponse" message="tns:consultarResponse"></output>
</operation>
</portType>
<binding name="BasicAlumnoServicePortBinding" type="tns:AlumnoService">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"></soap:binding>
<operation name="registrar">
<soap:operation soapAction=""></soap:operation>
<input>
<soap:body use="literal"></soap:body>
</input>
<output>
<soap:body use="literal"></soap:body>
</output>
</operation>
<operation name="consultar">
<soap:operation soapAction=""></soap:operation>
<input>
<soap:body use="literal"></soap:body>
</input>
<output>
<soap:body use="literal"></soap:body>
</output>
</operation>
</binding>
<service name="BasicAlumnoServiceService">
<port name="BasicAlumnoServicePort" binding="tns:BasicAlumnoServicePortBinding">
<soap:address location="http://localhost:8080/alumno"></soap:address>
</port>
</service>
</definitions>