cursoArquitecturaJava/LABM1C3-06WSAuth/usersOperations.log

19:30:52,392 [main      ] INFO  (ws.AlumnoServicePublisher) Servicio publicado!! - [linea:15]
19:43:21,319 [pool-1-thread-3] INFO  (handler.LogHandler) IN=[<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:consultar xmlns:ns2="http://ws.jaad.cibertec.edu/"><arg0>01</arg0></ns2:consultar></S:Body></S:Envelope>] - [linea:26]
19:43:21,319 [pool-1-thread-3] INFO  (handler.LogHandler) OUT=[<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:consultarResponse xmlns:ns2="http://ws.jaad.cibertec.edu/"/></S:Body></S:Envelope>] - [linea:26]
19:46:13,832 [pool-1-thread-4] INFO  (handler.LogHandler) IN=[<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:registrar xmlns:ns2="http://ws.jaad.cibertec.edu/"><arg0><dni>10453131</dni><edad>40</edad><nombre>Edgard</nombre></arg0></ns2:registrar></S:Body></S:Envelope>] - [linea:26]
19:46:13,832 [pool-1-thread-4] INFO  (handler.LogHandler) OUT=[<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:registrarResponse xmlns:ns2="http://ws.jaad.cibertec.edu/"><return>true</return></ns2:registrarResponse></S:Body></S:Envelope>] - [linea:26]
19:46:13,848 [pool-1-thread-4] INFO  (handler.LogHandler) IN=[<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:consultar xmlns:ns2="http://ws.jaad.cibertec.edu/"><arg0>01</arg0></ns2:consultar></S:Body></S:Envelope>] - [linea:26]
19:46:13,848 [pool-1-thread-4] INFO  (handler.LogHandler) OUT=[<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:consultarResponse xmlns:ns2="http://ws.jaad.cibertec.edu/"/></S:Body></S:Envelope>] - [linea:26]
19:47:33,455 [pool-1-thread-5] INFO  (handler.LogHandler) IN=[<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:registrar xmlns:ns2="http://ws.jaad.cibertec.edu/"><arg0><apellidos>Marquez</apellidos><dni>01</dni><edad>40</edad><nombre>Edgard</nombre></arg0></ns2:registrar></S:Body></S:Envelope>] - [linea:26]
19:47:33,455 [pool-1-thread-5] INFO  (handler.LogHandler) OUT=[<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:registrarResponse xmlns:ns2="http://ws.jaad.cibertec.edu/"><return>true</return></ns2:registrarResponse></S:Body></S:Envelope>] - [linea:26]
19:47:33,470 [pool-1-thread-5] INFO  (handler.LogHandler) IN=[<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:consultar xmlns:ns2="http://ws.jaad.cibertec.edu/"><arg0>01</arg0></ns2:consultar></S:Body></S:Envelope>] - [linea:26]
19:47:33,470 [pool-1-thread-5] INFO  (handler.LogHandler) OUT=[<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:consultarResponse xmlns:ns2="http://ws.jaad.cibertec.edu/"><return><apellidos>Marquez</apellidos><dni>01</dni><edad>40</edad><nombre>Edgard</nombre></return></ns2:consultarResponse></S:Body></S:Envelope>] - [linea:26]
20:16:01,113 [main      ] INFO  (ws.AlumnoServicePublisher) Servicio publicado!! - [linea:15]
20:18:04,221 [pool-1-thread-1] INFO  (handler.LogHandler) IN=[<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:registrar xmlns:ns2="http://ws.jaad.cibertec.edu/"><arg0><apellidos>Marquez</apellidos><dni>01</dni><edad>40</edad><nombre>Edgard</nombre></arg0></ns2:registrar></S:Body></S:Envelope>] - [linea:26]
20:18:04,299 [pool-1-thread-1] INFO  (handler.LogHandler) OUT=[<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:registrar xmlns:ns2="http://ws.jaad.cibertec.edu/"><arg0><apellidos>Marquez</apellidos><dni>01</dni><edad>40</edad><nombre>Edgard</nombre></arg0></ns2:registrar><S:Fault><faultcode>S:Server</faultcode><faultstring>El mensaje no tiene header.</faultstring></S:Fault></S:Body></S:Envelope>] - [linea:26]
20:18:22,806 [pool-1-thread-1] INFO  (handler.LogHandler) IN=[<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:registrar xmlns:ns2="http://ws.jaad.cibertec.edu/"><arg0><apellidos>Marquez</apellidos><dni>01</dni><edad>40</edad><nombre>Edgard</nombre></arg0></ns2:registrar></S:Body></S:Envelope>] - [linea:26]
20:18:22,806 [pool-1-thread-1] INFO  (handler.LogHandler) OUT=[<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:registrar xmlns:ns2="http://ws.jaad.cibertec.edu/"><arg0><apellidos>Marquez</apellidos><dni>01</dni><edad>40</edad><nombre>Edgard</nombre></arg0></ns2:registrar><S:Fault><faultcode>S:Server</faultcode><faultstring>El mensaje no tiene header.</faultstring></S:Fault></S:Body></S:Envelope>] - [linea:26]
20:22:18,213 [pool-1-thread-2] INFO  (handler.LogHandler) IN=[<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:consultar xmlns:ns2="http://ws.jaad.cibertec.edu/"><arg0>01</arg0></ns2:consultar></S:Body></S:Envelope>] - [linea:26]
20:22:18,213 [pool-1-thread-2] INFO  (handler.LogHandler) OUT=[<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:consultar xmlns:ns2="http://ws.jaad.cibertec.edu/"><arg0>01</arg0></ns2:consultar><S:Fault><faultcode>S:Server</faultcode><faultstring>El mensaje no tiene header.</faultstring></S:Fault></S:Body></S:Envelope>] - [linea:26]
20:23:39,695 [main      ] INFO  (ws.AlumnoServicePublisher) Servicio publicado!! - [linea:15]
20:24:05,233 [pool-1-thread-1] INFO  (handler.LogHandler) IN=[<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:consultar xmlns:ns2="http://ws.jaad.cibertec.edu/"><arg0>01</arg0></ns2:consultar></S:Body></S:Envelope>] - [linea:26]
20:24:05,233 [pool-1-thread-1] INFO  (handler.LogHandler) OUT=[<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:consultar xmlns:ns2="http://ws.jaad.cibertec.edu/"><arg0>01</arg0></ns2:consultar><S:Fault><faultcode>S:Server</faultcode><faultstring>El mensaje no tiene header.</faultstring></S:Fault></S:Body></S:Envelope>] - [linea:26]
20:32:47,831 [pool-1-thread-2] INFO  (handler.LogHandler) IN=[<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:consultar xmlns:ns2="http://ws.jaad.cibertec.edu/"><arg0>01</arg0></ns2:consultar></S:Body></S:Envelope>] - [linea:26]
20:32:47,831 [pool-1-thread-2] INFO  (handler.LogHandler) OUT=[<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:consultar xmlns:ns2="http://ws.jaad.cibertec.edu/"><arg0>01</arg0></ns2:consultar><S:Fault><faultcode>S:Server</faultcode><faultstring>El mensaje no tiene header.</faultstring></S:Fault></S:Body></S:Envelope>] - [linea:26]
